import numpy as np
from sys import getsizeof

"""
data = [등락율, 고저평균대비등락율, 초당거래대금, 초당거래대금평균, 당일거래대금, 체결강도, 체결강도평균, 최고체결강도,
      최저체결강도, 현재가, 초당매수수량, 초당매도수량, 매수잔량1, 매도잔량1, 매도총잔량, 매수총잔량, 체결시간,
      이평60, 이평300, 이평600]

a = [15.20, 2.68, 300, 100, 15200, 104.25, 100.05, 105.02, 98.01, 10000, 150000, 300000, 1000000,
     1000000, 1000000, 1000000, 20220129090001, 10000.123, 10000.123, 10000.123]
"""

a = [15.20, 2.68, 300, 100, 15200, 104.25, 100.05, 105.02, 98.01, 10000.00000001, 150000, 300000, 1000000,
     1000000, 1000000, 1000000, 20220129090001, 10000.00000001, 10000.00000001, 10000.00000001]

b = np.array([a], dtype='float32')
c = np.array([a], dtype='float64')

print('어레이 일자 기록 확인')
print(b[0, -4])
print(c[0, -4])

print('어레이 메모리 용량 확인')
print(f'float32 [{getsizeof(b)}]byte')
print(f'float64 [{getsizeof(c)}]byte')
