import time
import numpy as np

data_list = [
    1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31
]

start = time.time()
dict_day = {}
for i in range(1000):
    dict_day[i] = np.array(data_list)
print(time.time() - start)

start = time.time()
for i in range(1000):
    최고종가5, 최고고가5, 최고종가10, 최고고가10, 최고종가20, 최고고가20, 최고종가60, 최고고가60, 최고종가120, \
                최고고가120, 최고종가240, 최고고가240, 최저종가5, 최저저가5, 최저종가10, 최저저가10, 최저종가20, 최저저가20, \
                최저종가60, 최저저가60, 최저종가120, 최저저가120, 최저종가240, 최저저가240, 종가합계4, 종가합계9, 종가합계19, \
                종가합계59, 종가합계119, 종가합계239, 최고거래대금 = dict_day[i]
print(time.time() - start)

start = time.time()
dict_day = {}
for i in range(1000):
    dict_day[i] = data_list
print(time.time() - start)

start = time.time()
for i in range(1000):
    최고종가5, 최고고가5, 최고종가10, 최고고가10, 최고종가20, 최고고가20, 최고종가60, 최고고가60, 최고종가120, \
                최고고가120, 최고종가240, 최고고가240, 최저종가5, 최저저가5, 최저종가10, 최저저가10, 최저종가20, 최저저가20, \
                최저종가60, 최저저가60, 최저종가120, 최저저가120, 최저종가240, 최저저가240, 종가합계4, 종가합계9, 종가합계19, \
                종가합계59, 종가합계119, 종가합계239, 최고거래대금 = dict_day[i]
print(time.time() - start)
